martinroger/superPod/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.2.0 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s31"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_I2S_BCLK_PIN=45
CONFIG_I2S_WS_PIN=46
CONFIG_I2S_DOUT_PIN=47
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_BT_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_SPP_ENABLED=y
CONFIG_BT_LOG_HCI_TRACE_LEVEL_EVENT=y
CONFIG_BT_LOG_BTM_TRACE_LEVEL_EVENT=y
CONFIG_BT_LOG_GAP_TRACE_LEVEL_EVENT=y
CONFIG_BT_LOG_A2D_TRACE_LEVEL_EVENT=y
CONFIG_BT_LOG_AVRC_TRACE_LEVEL_EVENT=y
CONFIG_BT_LOG_BTIF_TRACE_LEVEL_EVENT=y
CONFIG_BTDM_CTRL_MODE_BTDM=y
CONFIG_LIBC_NEWLIB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=1
CONFIG_FATFS_LFN_NONE=y
CONFIG_FATFS_USE_DYN_BUFFERS=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IN_IRAM=y
CONFIG_MBEDTLS_THREADING_C=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=y
CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI=n
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n
CONFIG_TINYUSB_DESC_CUSTOM_VID=0x67b
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x2303
CONFIG_TINYUSB_DESC_BCD_DEVICE=0x400
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Spoolific"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="ESPL2303"
CONFIG_TINYUSB_DESC_SERIAL_STRING=""
CONFIG_TINYUSB_VENDOR_COUNT=1
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
